# DATA PROCESSING

El objetivo de este notebook es cargar cada uno de los archivos csv que contienen los datos de los diferentes datasets y realizar un preprocesamiento de los mismos para posteriormente combinarlos en un único dataFrame.

En el preprocesamiento se realizarán las siguientes tareas:
- Cargar los datos en un dataFrame
- Eliminar las columnas o filas de datos totales
- Eliminar los datos a nivel nacional
- Eliminar las columnas con el nombre de la comunidad autónoma para evitar duplicidad.

## Preparación del entorno

In [2]:
import pandas as pd
import os 

RAW_DATA_PATH = os.path.join("..", "data/raw/")

## Consumo Electrico Anual

In [ ]:
import pandas as pd

consumo_df = pd.read_csv(RAW_DATA_PATH+ "ConsumoElectricoAnual.csv", sep="\t", encoding="latin1")
consumo_df.rename(columns={"Comunidades y Ciudades Autï¿½nomas": "Comunidades Autónomas", "aï¿½o": "Año"}, inplace=True) #linux
consumo_df.rename(columns={"Comunidades y Ciudades Autónomas": "Comunidades Autónomas", "año": "Año"}, inplace=True) #windows
#nota: por alguna razón, el encoding funciona distinto, la función 'rename' ignora los errores si la columna no tiene el mismo nombre
consumo_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Total Nacional         100 non-null    object
 1   Comunidades Autónomas  95 non-null     object
 2   Producto consumido     100 non-null    object
 3   Año                    100 non-null    int64
 4   Total                  100 non-null    object
dtypes: int64(1), object(4)
memory usage: 4.0+ KB

In [5]:
consumo_df.head(7)

   Total Nacional Comunidades Autónomas Producto consumido   Año       Total
0  Total Nacional                   NaN       Electricidad  2022  14.319.055
1  Total Nacional                   NaN       Electricidad  2021   8.892.228
2  Total Nacional                   NaN       Electricidad  2019   6.367.976
3  Total Nacional                   NaN       Electricidad  2017   6.227.459
4  Total Nacional                   NaN       Electricidad  2015   6.177.084
5  Total Nacional          01 Andalucía       Electricidad  2022   1.653.989
6  Total Nacional          01 Andalucía       Electricidad  2021     941.599

Comprobación de si hay datos nulos

In [6]:
print(consumo_df.isnull().sum())

Total Nacional           0
Comunidades Autónomas    5
Producto consumido       0
Año                      0
Total                    0
dtype: int64

Eliminamos los valores nulos en las comunidades autónomas, que representan el total nacional.

In [7]:
consumo_df.dropna(subset=["Comunidades Autónomas"], inplace=True)

Eliminamos las columnas "Total Nacional" y "Producto consumido", ya que, todos los registros contienen el mismo valor en ambas columnas

In [8]:
consumo_df.drop(columns=["Total Nacional", "Producto consumido"], inplace=True)

Para cada valor de la columna "Comunidades y Ciudades Autónomas", eliminamos los 3 primeros carácteres

In [9]:
consumo_df["Comunidades Autónomas"] = consumo_df["Comunidades Autónomas"].str.replace(r"\b\d{2} ", "", regex=True)

In [10]:
consumo_df.head()

  Comunidades Autónomas   Año      Total
5             Andalucía  2022  1.653.989
6             Andalucía  2021    941.599
7             Andalucía  2019    637.486
8             Andalucía  2017    603.104
9             Andalucía  2015    572.742

## Dispositivos de energía renovable

## Distribución de edad de la población española

In [2]:
edad_df=pd.read_csv(RAW_DATA_PATH+"Distribución de edad de la población española.csv", sep = ";", encoding = "latin")

edad_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12672 entries, 0 to 12671
Data columns (total 8 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Total Nacional                    12672 non-null  object
 1   Comunidades y Ciudades Autónomas  12496 non-null  object
 2   Provincias                        9152 non-null   object
 3   Españoles/Extranjeros             12672 non-null  object
 4   Edad (grupos quinquenales)        12672 non-null  object
 5   Sexo                              12672 non-null  object
 6   Periodo                           12672 non-null  object
 7   Total                             12672 non-null  object
dtypes: object(8)
memory usage: 792.1+ KB

In [3]:
# ejemplo de los datos de la tabla para una provincia
edad_df.head(600).tail(8)

,Total Nacional,Comunidades y Ciudades Autónomas,Provincias,Españoles/Extranjeros,Edad (grupos quinquenales),Sexo,Periodo,Total
592,Total Nacional,01 Andalucía,11 Cádiz,Total,De 35 a 39 años,Total,1 de enero de 2022,83.985
593,Total Nacional,01 Andalucía,11 Cádiz,Total,De 35 a 39 años,Total,1 de enero de 2021,87.048
594,Total Nacional,01 Andalucía,11 Cádiz,Total,De 35 a 39 años,Total,1 de enero de 2020,90.338
595,Total Nacional,01 Andalucía,11 Cádiz,Total,De 35 a 39 años,Total,1 de enero de 2019,93.464
596,Total Nacional,01 Andalucía,11 Cádiz,Total,De 35 a 39 años,Total,1 de enero de 2018,96.477
597,Total Nacional,01 Andalucía,11 Cádiz,Total,De 35 a 39 años,Total,1 de enero de 2017,99.754
598,Total Nacional,01 Andalucía,11 Cádiz,Total,De 35 a 39 años,Total,1 de enero de 2016,102.768
599,Total Nacional,01 Andalucía,11 Cádiz,Total,De 35 a 39 años,Total,1 de enero de 2015,104.523

In [4]:
print(edad_df[['Total Nacional', 'Españoles/Extranjeros','Sexo']].nunique())

Total Nacional           1
Españoles/Extranjeros    1
Sexo                     1
dtype: int64

Observamos que las columnas 'Total Nacional', 'Españoles/Extranjeros' y 'Sexo' no aportan ninguna información, por lo que se pueden eliminar.

In [5]:
edad_df.drop(columns=['Total Nacional', 'Españoles/Extranjeros', 'Sexo'], inplace=True)

Hemos decidido quedarnos solo con los datos del 2022, por lo que se pueden eliminar las filas de otros años y después la columna 'Periodo'.

In [6]:
edad_df.drop(edad_df[edad_df['Periodo'] != '1 de enero de 2022'].index, inplace=True)
edad_df.drop(columns=['Periodo'], inplace=True)

Los primeros registros del dataset son los datos a nivel nacional, donde la comunidad autónoma y la provincia son valores nulos, por lo que se pueden eliminar. Además, se eliminará la columna 'Comunidades y Ciudades Autónomas' y las filas con los totales en 'Edad'.

In [7]:
edad_df.head()

,Comunidades y Ciudades Autónomas,Provincias,Edad (grupos quinquenales),Total
0,NaN,NaN,Todas las edades,47.475.420
8,NaN,NaN,De 0 a 4 años,1.809.768
16,NaN,NaN,De 5 a 9 años,2.236.911
24,NaN,NaN,De 10 a 14 años,2.517.373
32,NaN,NaN,De 15 a 19 años,2.471.599

In [8]:
edad_df.dropna(subset=["Comunidades y Ciudades Autónomas", "Provincias"], inplace=True)
edad_df.drop(columns=['Comunidades y Ciudades Autónomas'], inplace=True)
edad_df.drop(edad_df[edad_df['Edad (grupos quinquenales)'] == 'Todas las edades'].index, inplace=True)

Se eliminará el número que identifica a cada provincia para dejar solo el nombre.

In [9]:
edad_df["Provincias"] = edad_df["Provincias"].str.replace(r"^\d+\s", "", regex=True)

Una vez finalizado el preprocesamiento, el dataset queda con 1092 entradas y 3 columnas.

In [36]:
edad_df.head()

    Provincias Edad (grupos quinquenales)   Total
360    Almería              De 0 a 4 años  36.360
368    Almería              De 5 a 9 años  41.033
376    Almería          De 10 a 14 años    43.411
384    Almería          De 15 a 19 años    40.722
392    Almería            De 20 a 24 años  41.532

In [10]:
edad_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1092 entries, 360 to 12664
Data columns (total 3 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Provincias                  1092 non-null   object
 1   Edad (grupos quinquenales)  1092 non-null   object
 2   Total                       1092 non-null   object
dtypes: object(3)
memory usage: 34.1+ KB

## Intensidad de uso en viviendas

In [12]:
import pandas as pd 

intensidad_df = pd.read_csv(RAW_DATA_PATH + "Intensidad de uso en viviendas.csv", sep=";", encoding="latin1")
intensidad_df.rename(columns={"Comunidades y Ciudades Autónomas": "Comunidades Autónomas"}, inplace=True)
intensidad_df.head()

,Total Nacional,Comunidades Autónomas,Provincias,Municipios,Consumo eléctrico,Total
0,Total Nacional,NaN,NaN,NaN,Viviendas totales,26.623.708
1,Total Nacional,NaN,NaN,NaN,Viviendas vacías,3.837.328
2,Total Nacional,NaN,NaN,NaN,Mediana consumo anual,2.196
3,Total Nacional,NaN,NaN,NaN,Viviendas con bajo consumo,943.924
4,Total Nacional,NaN,NaN,NaN,Viviendas de uso esporádico,2.514.511

Comprobamos si hay valores nulos en cada una de las columnas del dataframe

In [18]:
intensidad_df.isnull().sum()

Comunidades Autónomas    0
Provincias               0
Consumo eléctrico        0
Total                    0
dtype: int64

In [14]:
len(intensidad_df["Comunidades Autónomas"].tolist())

954

En este proyecto se realizarán una serie de analísis de datos teniendo en cuenta únicamente las comunidades autónomas y las provincias, por lo que se elimina la columna "Municipios",ya que no nos ofrece información útil para el estudio.

Además, se elimina la columna "Total Nacional" ya que tampoco aporta ninguna información.

In [15]:
intensidad_df.drop(columns=["Municipios","Total Nacional"], inplace=True)

Eliminamos las filas con valores en "Provincia" y "Comunidad Autónoma" nulos. Además de la columna Comunidad Autónoma.

In [21]:
intensidad_df.dropna(subset=["Provincias"],inplace=True)
intensidad_df.drop(columns=["Comunidades Autónomas"], inplace=True)

Quitamos el número de la provincia para dejar solo el nombre.

In [19]:
intensidad_df["Provincias"] = intensidad_df["Provincias"].str.replace(r"^\d+\s", "", regex=True)

## Producción de energía por lugar

## Renta por hogar por comunidades autónomas

In [4]:
# Leer el archivo CSV con un delimitador y manejo de errores por tildes
renta_df = pd.read_csv(RAW_DATA_PATH+"Renta por hogar por comunidades autónomas.csv", sep = ";", encoding = "latin")

renta_df.head()

,Comunidades y Ciudades Autónomas,Renta anual neta media por hogar,Periodo,Total
0,Total Nacional,Renta neta media por hogar,2022,32.216
1,Total Nacional,Renta neta media por hogar,2021,30.552
2,Total Nacional,Renta neta media por hogar,2020,30.690
3,Total Nacional,Renta media por hogar (con alquiler imputado),2022,37.363
4,Total Nacional,Renta media por hogar (con alquiler imputado),2021,35.497

In [5]:
#Comprobar si hay valores nulos
renta_df.isnull().sum()

Comunidades y Ciudades Autónomas    0
Renta anual neta media por hogar    0
Periodo                             0
Total                               0
dtype: int64

In [6]:
#Cambiar el nombre de la columna a simplemente "Comunidades".
renta_df.rename(columns={'Comunidades y Ciudades Autónomas': 'Comunidades'}, inplace=True)

renta_df.head()

,Comunidades,Renta anual neta media por hogar,Periodo,Total
0,Total Nacional,Renta neta media por hogar,2022,32.216
1,Total Nacional,Renta neta media por hogar,2021,30.552
2,Total Nacional,Renta neta media por hogar,2020,30.690
3,Total Nacional,Renta media por hogar (con alquiler imputado),2022,37.363
4,Total Nacional,Renta media por hogar (con alquiler imputado),2021,35.497

In [7]:
#Eliminar filas que contienen la media de renta por hogar con alquiler imputado.
renta_df = renta_df[renta_df['Renta anual neta media por hogar'] != 'Renta media por hogar (con alquiler imputado)']


#Eliminar la columna "Renta anual media por hogar" pues no es relevante.
renta_df.drop(columns='Renta anual neta media por hogar', inplace=True)

renta_df.head()

      Comunidades  Periodo   Total
0  Total Nacional     2022  32.216
1  Total Nacional     2021  30.552
2  Total Nacional     2020  30.690
6    01 Andalucía     2022  27.446
7    01 Andalucía     2021  25.601

In [ ]:
#Eliminar los valores totales por comunidad
renta_df  = renta_df[renta_df['Comunidades'] != 'Total Nacional']

renta_df.head()

In [ ]:
#Eliminar identificadores de las comunidades
renta_df['Comunidades'] = renta_df['Comunidades'].str.replace(r'^\d{2} ', '', regex=True)

renta_df.head()

## Salario medio de la población española

In [8]:
# Leer el archivo CSV con un delimitador y manejo de errores por tildes
salario_df = pd.read_csv(RAW_DATA_PATH+"Salario medio de la población española.csv", sep = ";", encoding = "latin")

salario_df.head()

,Tipo de jornada,Comunidades y Ciudades Autonómas,Decil,Periodo,Total
0,Total,Total Nacional,Total decil,2022,"2.128,37"
1,Total,Total Nacional,Total decil,2021,"2.086,78"
2,Total,Total Nacional,1,2022,"623,30"
3,Total,Total Nacional,1,2021,"570,52"
4,Total,Total Nacional,2,2022,"1.138,68"

In [9]:
#Comprobar si hay valores nulos
salario_df.isnull().sum()

Tipo de jornada                     0
Comunidades y Ciudades Autonómas    0
Decil                               0
Periodo                             0
Total                               0
dtype: int64

In [10]:
#Cambiar el nombre de la columna a simplemente "Comunidades".
salario_df.rename(columns={'Comunidades y Ciudades Autonómas': 'Comunidades'}, inplace=True)

salario_df.head()

  Tipo de jornada     Comunidades        Decil  Periodo     Total
0           Total  Total Nacional  Total decil     2022  2.128,37
1           Total  Total Nacional  Total decil     2021  2.086,78
2           Total  Total Nacional            1     2022    623,30
3           Total  Total Nacional            1     2021    570,52
4           Total  Total Nacional            2     2022  1.138,68

In [11]:
#No es de relevancia saber si "Tipo de Jornada" es completa o parcial, por lo que se eliminan las filas que contienen esta información.
salario_df = salario_df[salario_df['Tipo de jornada'] != 'Jornada a tiempo completo']
salario_df = salario_df[salario_df['Tipo de jornada'] != 'Jornada a tiempo parcial']

#Eliminar la columna "Tipo de jornada" ya que no es relevante.
salario_df.drop(columns='Tipo de jornada', inplace=True)

salario_df.head()

      Comunidades        Decil  Periodo     Total
0  Total Nacional  Total decil     2022  2.128,37
1  Total Nacional  Total decil     2021  2.086,78
2  Total Nacional            1     2022    623,30
3  Total Nacional            1     2021    570,52
4  Total Nacional            2     2022  1.138,68

In [12]:
#Eliminar el total decil.
salario_df = salario_df[salario_df['Decil'] != 'Total decil']

#Eliminar los valores totales por comunidad
salario_df  = salario_df[salario_df['Comunidades'] != 'Total Nacional']

salario_df.head()

     Comunidades Decil  Periodo     Total
24  01 Andalucía     1     2022    626,54
25  01 Andalucía     1     2021    571,95
26  01 Andalucía     2     2022  1.139,95
27  01 Andalucía     2     2021  1.043,06
28  01 Andalucía     3     2022  1.346,28

In [13]:
#Eliminar identificadores de las comunidades
salario_df['Comunidades'] = salario_df['Comunidades'].str.replace(r'^\d{2} ', '', regex=True)

salario_df.head()

   Comunidades Decil  Periodo     Total
24   Andalucía     1     2022    626,54
25   Andalucía     1     2021    571,95
26   Andalucía     2     2022  1.139,95
27   Andalucía     2     2021  1.043,06
28   Andalucía     3     2022  1.346,28

In [14]:
# Ver 5 filas aleatorias
filas_aleatorias = salario_df.sample(n=5)
filas_aleatorias

                     Comunidades Decil  Periodo     Total
350  Navarra, Comunidad Foral de    10     2022  4.701,68
138                    Cantabria     3     2022  1.340,60
56                        Aragón     6     2022  1.919,00
423                      Melilla     2     2021  1.023,66
354                   País Vasco     1     2022    602,42

## Tipo de núcleo familiar

In [11]:
tipo_nucleo_familiar_df=pd.read_csv(RAW_DATA_PATH+"Tipo de núcleo familiar.csv", sep = ";", encoding = "latin")

tipo_nucleo_familiar_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1855 entries, 0 to 1854
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Provincias               1855 non-null   object
 1   Tipo de núcleo familiar  1855 non-null   object
 2   Número de hijos          1855 non-null   object
 3   Total                    1855 non-null   object
dtypes: object(4)
memory usage: 58.1+ KB

In [12]:
# Ejemplo de los datos que presenta la tabla
tipo_nucleo_familiar_df.head(800).tail(10)

,Provincias,Tipo de núcleo familiar,Número de hijos,Total
790,Granada,"Pareja no casada, con o sin hijos convivientes",Total,35.412
791,Granada,Padre sólo con hijos convivientes,0 hijos conviviendo,0
792,Granada,Padre sólo con hijos convivientes,1 hijo conviviendo,4.959
793,Granada,Padre sólo con hijos convivientes,2 o más hijos conviviendo,3.217
794,Granada,Padre sólo con hijos convivientes,0 hijos conviviendo menores de 25 años,4.200
795,Granada,Padre sólo con hijos convivientes,1 hijo conviviendo menor de 25 años,2.442
796,Granada,Padre sólo con hijos convivientes,2 hijos o más conviviendo menores de 25 años,1.534
797,Granada,Padre sólo con hijos convivientes,Total,8.176
798,Granada,Madre sóla con hijos convivientes,0 hijos conviviendo,0
799,Granada,Madre sóla con hijos convivientes,1 hijo conviviendo,28.188

En la columna "Provincias", algunas filas están etiquetadas como "Total Nacional". Para simplificar el conjunto de datos, se ha decidido eliminar los registros correspondientes a los datos a nivel nacional.

In [13]:
tipo_nucleo_familiar_df.head(5)

,Provincias,Tipo de núcleo familiar,Número de hijos,Total
0,Total Nacional,Total,0 hijos conviviendo,4.484.568
1,Total Nacional,Total,1 hijo conviviendo,4.914.044
2,Total Nacional,Total,2 o más hijos conviviendo,4.368.298
3,Total Nacional,Total,0 hijos conviviendo menores de 25 años,6.973.068
4,Total Nacional,Total,1 hijo conviviendo menor de 25 años,3.349.425

In [14]:
tipo_nucleo_familiar_df = tipo_nucleo_familiar_df[tipo_nucleo_familiar_df['Provincias'] != "Total Nacional"]

In [15]:
tipo_nucleo_familiar_df.head(10)

,Provincias,Tipo de núcleo familiar,Número de hijos,Total
35,Albacete,Total,0 hijos conviviendo,33.012
36,Albacete,Total,1 hijo conviviendo,35.351
37,Albacete,Total,2 o más hijos conviviendo,41.228
38,Albacete,Total,0 hijos conviviendo menores de 25 años,52.429
39,Albacete,Total,1 hijo conviviendo menor de 25 años,25.451
40,Albacete,Total,2 hijos o más conviviendo menores de 25 años,31.712
41,Albacete,Total,Total,109.592
42,Albacete,"Pareja casada, con o sin hijos convivientes",0 hijos conviviendo,27.344
43,Albacete,"Pareja casada, con o sin hijos convivientes",1 hijo conviviendo,21.719
44,Albacete,"Pareja casada, con o sin hijos convivientes",2 o más hijos conviviendo,31.743

En la columna "Tipo de núcleo familiar" se ha encontrado un valor "Total", el cual será eliminado.

In [16]:
tipo_nucleo_familiar_df = tipo_nucleo_familiar_df[tipo_nucleo_familiar_df['Tipo de núcleo familiar'] != "Total"]


Lo mismo sucede con la columna "Número de hijos".

In [17]:
tipo_nucleo_familiar_df = tipo_nucleo_familiar_df[tipo_nucleo_familiar_df['Número de hijos'] != "Total"]

En el dataset, el símbolo '.' debe interpretarse como dato que no se proporciona por muestra insuficiente.

In [18]:
columnas_a_verificar = ['Provincias', 'Tipo de núcleo familiar', 'Número de hijos', 'Total']
tipo_nucleo_familiar_df[columnas_a_verificar].apply(lambda x: x == '.').any()

Provincias                 False
Tipo de núcleo familiar    False
Número de hijos            False
Total                      False
dtype: bool

No se han encontrado valores nulos.

Una vez finalizado el preprocesamiento, el dataset queda con 1248 entradas y 4 columnas.

In [31]:
tipo_nucleo_familiar_df.head(10)

,Provincias,Tipo de núcleo familiar,Número de hijos,Total
42,Albacete,"Pareja casada, con o sin hijos convivientes",0 hijos conviviendo,27.344
43,Albacete,"Pareja casada, con o sin hijos convivientes",1 hijo conviviendo,21.719
44,Albacete,"Pareja casada, con o sin hijos convivientes",2 o más hijos conviviendo,31.743
45,Albacete,"Pareja casada, con o sin hijos convivientes",0 hijos conviviendo menores de 25 años,39.498
46,Albacete,"Pareja casada, con o sin hijos convivientes",1 hijo conviviendo menor de 25 años,16.930
47,Albacete,"Pareja casada, con o sin hijos convivientes",2 hijos o más conviviendo menores de 25 años,24.377
49,Albacete,"Pareja no casada, con o sin hijos convivientes",0 hijos conviviendo,5.669
50,Albacete,"Pareja no casada, con o sin hijos convivientes",1 hijo conviviendo,3.085
51,Albacete,"Pareja no casada, con o sin hijos convivientes",2 o más hijos conviviendo,3.555
52,Albacete,"Pareja no casada, con o sin hijos convivientes",0 hijos conviviendo menores de 25 años,5.669

In [35]:
a = tipo_nucleo_familiar_df['Tipo de núcleo familiar'].unique()
print(a)

['Pareja casada, con o sin hijos convivientes'
 'Pareja no casada, con o sin hijos convivientes'
 'Padre sólo con hijos convivientes' 'Madre sóla con hijos convivientes']

## Viviendas según el número de personas

In [20]:
viviendas_numero_personas_df=pd.read_csv(RAW_DATA_PATH+"Viviendas según el número de personas.csv", sep = ";", encoding = "latin")

viviendas_numero_personas_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1764 entries, 0 to 1763
Data columns (total 6 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Total Nacional                    1764 non-null   object
 1   Comunidades y Ciudades Autónomas  1736 non-null   object
 2   Provincias                        1204 non-null   object
 3   Tamaño del hogar                  1764 non-null   object
 4   Año                               1764 non-null   int64
 5   Total                             1764 non-null   object
dtypes: int64(1), object(5)
memory usage: 82.8+ KB

In [21]:
# Ejemplo de los datos que presenta la tabla
viviendas_numero_personas_df.head(10)

,Total Nacional,Comunidades y Ciudades Autónomas,Provincias,Tamaño del hogar,Año,Total
0,Total Nacional,NaN,NaN,Total,2023,18.849.621
1,Total Nacional,NaN,NaN,Total,2022,18.791.675
2,Total Nacional,NaN,NaN,Total,2021,18.736.673
3,Total Nacional,NaN,NaN,Total,2020,18.692.279
4,Total Nacional,NaN,NaN,1 persona,2023,4.987.240
5,Total Nacional,NaN,NaN,1 persona,2022,4.933.214
6,Total Nacional,NaN,NaN,1 persona,2021,4.881.986
7,Total Nacional,NaN,NaN,1 persona,2020,4.829.600
8,Total Nacional,NaN,NaN,2 personas,2023,5.804.559
9,Total Nacional,NaN,NaN,2 personas,2022,5.763.142

In [22]:
print(viviendas_numero_personas_df[['Total Nacional']].nunique())

Total Nacional    1
dtype: int64

La columna "Total Nacional" se eliminará ya que no añade valor al conjunto de datos.

In [23]:
viviendas_numero_personas_df.drop(columns=['Total Nacional'], inplace=True)

Se van a eliminar las primeras 28 filas del dataset ya que corresponden a los datos totales nacionales.

In [24]:
viviendas_numero_personas_df = viviendas_numero_personas_df.drop(index=range(0, 28))

Para cada comunidad autónoma, hay filas que corresponden al total de dicha comunidad, lo cual se representa con valores nulos en la columna "Provincias". El inconveniente es que, en comunidades con solo una provincia, los valores de la columna "Provincias" también son nulos. Por esta razón, se desea asignar el nombre de la provincia a las filas de comunidades autónomas que cuentan con una sola provincia y eliminar los valores totales en las comunidades autónomas con varias provincias.

In [25]:
# Definir el diccionario de asignaciones
asignaciones = {
    "03 Asturias, Principado de": "Asturias",
    "04 Balears, Illes": "Balears, Illes",
    "06 Cantabria": "Cantabria",
    "13 Madrid, Comunidad de": "Murcia",
    "14 Murcia, Región de": "Madrid",
    "15 Navarra, Comunidad Foral de":"Navarra", 
    "17 Rioja, La": "Rioja, La",
    "18 Ceuta": "Ceuta",
    "19 Melilla": "Melilla"
}

# Identificar las comunidades autónomas con una sola provincia
comunidades_uniprovinciales = set(asignaciones.keys())

# Reemplazar valores nulos en "Provincias" para comunidades uniprovinciales
for comunidad, provincia in asignaciones.items():
    viviendas_numero_personas_df.loc[(viviendas_numero_personas_df["Comunidades y Ciudades Autónomas"] == comunidad) & (viviendas_numero_personas_df["Provincias"].isnull()), "Provincias"] = provincia

# Eliminar filas de valores totales por comunidad autónoma
viviendas_numero_personas_df = viviendas_numero_personas_df.dropna(subset=["Provincias"])

Se elimina la columna por comunidad autónoma.

In [26]:
viviendas_numero_personas_df = viviendas_numero_personas_df.drop(columns=["Comunidades y Ciudades Autónomas"])

En la columna "Tamaño del hogar", hay filas que contienen el total y otras que indican el tamaño medio. Se eliminarán aquellas que cumplan con cualquiera de estas condiciones.

In [27]:
viviendas_numero_personas_df = viviendas_numero_personas_df[viviendas_numero_personas_df['Tamaño del hogar'] != "Total"]
viviendas_numero_personas_df = viviendas_numero_personas_df[viviendas_numero_personas_df['Tamaño del hogar'] != "Tamaño medio"]

Hemos decidido quedarnos solo con los datos del 2022, por lo que se pueden eliminar las filas de otros años y después la columna 'Año'.

In [28]:
viviendas_numero_personas_df.drop(viviendas_numero_personas_df[viviendas_numero_personas_df['Año'] != 2022].index, inplace=True)
viviendas_numero_personas_df.drop(columns=['Año'], inplace=True)

Una vez finalizado el preprocesamiento, el dataset queda con 260 entradas y 3 columnas.

In [29]:
viviendas_numero_personas_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 260 entries, 61 to 1757
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Provincias        260 non-null    object
 1   Tamaño del hogar  260 non-null    object
 2   Total             260 non-null    object
dtypes: object(3)
memory usage: 8.1+ KB

In [30]:
viviendas_numero_personas_df.head(10)

     Provincias  Tamaño del hogar    Total
61   04 Almería         1 persona   62.352
65   04 Almería        2 personas   77.714
69   04 Almería        3 personas   54.438
73   04 Almería        4 personas   51.754
77   04 Almería  5 personas o más   22.374
89     11 Cádiz         1 persona  109.454
93     11 Cádiz        2 personas  131.124
97     11 Cádiz        3 personas  108.196
101    11 Cádiz        4 personas   98.965
105    11 Cádiz  5 personas o más   28.595